[
    {
        "tweet": "$ORCL a lot of these already played out a bit as they came earlier in the week I like the chart idea and risk short against the recent highs"
    },
    {
        "tweet": "$ORCL 117 CALL FEB 16TH ***EXTREME  HIGH RISK***"
    },
    {
        "tweet": "$orcl. will history repeat itself?"
    },
    {
        "tweet": "$ORCL We noted with our members the hard rejection off of the failed ~$117.75 pivot break, and we gave the expectation of a potential retest of the triangle below.  Perfectly timed bounce off of that retest here. Free 3-day trial at http://TATrades.com/memberships"
    },
    {
        "tweet": "David Tepper's top buy is $ORCL in Q4. It is a ~$140M new position, representing ~2.6% of portfolio. The dollar amount represents 33% of all purchases he made in the quarter. No doubt it is significant. The question is WHY? and Why now??👇🏼"
    },
    {
        "tweet": "$ORCL entering a volume gap BUT  the 200 SMA, year to date AVWAP and 382 FIB  line up around the $110 area will it find support there?"
    },
    {
        "tweet": "$ORCL Double top, double bottom (repeating pattern) Hard top rejection. Moving into a support zone Neutral option flow aligns to range bound action. Gap last earnings, next is 3/7 Tap a ❤️if you like the TA & Flow charts, I'll keep them coming as time allows #stocks…"
    },
    {
        "tweet": "$ORCL entering a volume gap BUT  the 200 SMA, year to date AVWAP and 382 FIB  line up around the $110 area will it find support there?"
    },
    {
        "tweet": "$ORCL has a chart that is hard to read. I see double double top and am short."
    },
    {
        "tweet": "$ORCL - Looks like a double top is forming; if the 21w MA does not hold here, this could retest demand @ 100-102."
    },
    {
        "tweet": "$ORCL The pullback continues off of the~$117.70 failed breakout.  If this 200 day MA level cannot hold, then there is room to retest the previous ascending triangle breakout just below $107."
    },
    {
        "tweet": "$ORCL interesting price range. Currently bearish. Possible bounce post earnings."
    },
    {
        "tweet": "Michael Burry recently adjusted his investment portfolio by closing his $47 million wager against semiconductors $SOXX. His current holdings include: 1. Alibaba $BABA at 6.15% 2. JD $JD at 6.11% 3. HCA Healthcare $HCA at 5.72% 4. Oracle $ORCL 5.57%"
    },
    {
        "tweet": "This is the reason why $ORCL cloud wasn’t doing shit in terms of growth up until these past 2 years: because they are the best provider specifically for companies with complex AI workloads which is increasingly becoming everybody with large complex or tech business over time."
    }
]