[
    {
        "tweet": "NVIDIA REPORTS EARNINGS TOMORROW AFTER CLOSE EXPECTED NUMBERS REVENUE -> $20.6 BILLION ( UP 240% YoY ) FROM $6 BILLION LAST YEAR  EPS ->  $4.63 ( UP 712% YoY ) FROM $0.57 LAST YEAR NET INCOME -> $10.4 BILLION ( UP 640% ) FROM $1.41 BILLION LAST YEAR $NVDA"
    },
    {
        "tweet": "$NVDA carrying my entire retirement portfolio heading into earnings"
    },
    {
        "tweet": "Analysts are forecasting Nvidia's annual revenue will jump to $110 billion by 2026, up from $59 billion in the fiscal year that just ended. $NVDA"
    },
    {
        "tweet": "Nvidia $NVDA is now down more than 5% so far today ahead of its earnings tomorrow after the markets close"
    },
    {
        "tweet": "$NVDA currently trades at 100x FCF. For the comparison, $BABA trades at 6 times FCF. If you are in the stock, it is okey as the growth justifies the current valuation. If you are out, stay out as betting on 100% growth for a company with $1.7 trillion cap isn't smart."
    },
    {
        "tweet": "Just sold my $NVDA bought earlier today and took the $7,000ish win. That's how you play it. I'll buy any dip again tomorrow and flip it again. F!ck $TSLA"
    },
    {
        "tweet": "First Super Micro $SMCI and now Nvidia.  $NVDA on track for its biggest loss since May"
    },
    {
        "tweet": "Never forget, this time it's different. $NVDA"
    },
    {
        "tweet": "Once again $NVDA managed to greatly over inflate its revenues estimates between bringing forward all its future bookings as revenues and circling back its cash investing into customers that placed orders for its GPUs I wonder why few noticed 2022 vs 2023 growth is negative 🙈"
    },
    {
        "tweet": "Never forget, this time it’s different. $NVDA"
    },
    {
        "tweet": "We have $NVDA earnings after hours tomorrow & jobless claims at 8:30 Thursday morning. Expect A LOT of volatility in the market!!🎢"
    },
    {
        "tweet": "⚠️BREAKING: *NVIDIA STOCK SINKS 6% WITH EARNINGS COMING UP ON WEDNESDAY $NVDA"
    }
]